package practise;

/**
 * http://oj.rnd.huawei.com/problems/21/details
 * 题目描述
 * 为什么1小时有60分钟，而不是100分钟呢？这是历史上的习惯导致。但也并非纯粹的偶然：60是个优秀的数字，它的因子比较多。事实上，它是1至6的每个数字的倍数。即1,2,3,4,5,6都是可以除尽60。
 * 我们希望寻找到能除尽1至n的的每个数字的最小整数。
 * <p>
 * 解答要求
 * 时间限制：6000ms, 内存限制：100MB
 * 输入
 * 输入一个整数n,(1<n<=100），测试包含组样例，读到文件末尾结束。
 * <p>
 * 输出
 * 输出求1至n的最小公倍数。
 * <p>
 * 样例
 * 输入样例 1 复制
 * <p>
 * 6
 * 10
 * 100
 * 输出样例 1
 * <p>
 * 60
 * 2520
 * 69720375229712477164533808935312303556800
 */
public class Demo21_NO {
    public static void main(String[] args) {

    }
}
